2024/rapport-2024-07-12.org
#+title: Rapport hebdomadaire
#+subtitle: Contrat Été 2024
#+author: Charles-Édouard Lizotte
#+date:12/07/2024
#+LANGUAGE: fr
#+BIBLIOGRAPHY: master-bibliography.bib
#+OPTIONS: toc:nil title:nil 
#+LaTeX_class: org-report

\mytitlepage
\tableofcontents\newpage

* Notes tirées de Dumont (2022) et Herman (2022)

** Introduction

[cite/t/c:@dumont2022marginal] parle principalement de la MIZ (pout « /Marginal Ice Zone »/) en mentionnant qu'elle est a un rôle important dans l'étude des deux pôles et nous fait un récapitulatif historique depuis 1970.
Entre autre : 
+ La glace de mer module l'échange de chaleur, de masse et de momentum entre l'océan et l'atmosphère;
+ C'est un habitat très important pour beaucoup d'espèces et c'est un medium de transport pour de nombreuses communautés.

Comment définir la MIZ?
À l'aide de satellites, il est possible d'acquérir la concentration de glace de mer (/Sea Ice Concentration/ [SIC]).
On établie la glace de mer avec un niveau définit par
\begin{equation}
   15\% < SIC < 80\%. 
\end{equation}

Dans l'article de Liu et al (1993) /Wave effects on ocean-ice interaction in the marginal ice
zone/, on mentionne que
#+begin_quote
« Wave radiation stress acts to sharpen ice edges and enhances wind stress and thus amplifies the formation of eddies and the associated baroclinic response of the ocean, thus contributing to the two last mechanisms. »
#+end_quote

Dany pose la question : Quelles sont les avenues qui pourraient nous aider à systématiquement décrire le comportement de la glace dans la zone marginale (MIZ)?
+ Reconnaissance de patron (/patern recognition/)?
+ Comprendre la propagation des vagues dans la MIZ.
+ Mesure systématique de la taille des floes dans un modèle granulaire.


