2024/Fichiers_tex/rapport-2024-07-12.tex


\subsection{Équations dynamiques et balance}
\label{sec:org9afab30}
Essentiellement, tout a été fait par \Textcite{coon1974modeling} par le groupe AIDJEX dans les années 70.
Ce qui est utilisé partout pour la dynamique
\begin{equation}
   \rho_i h \qty(\pdv{\uu}{t} + f\kvf\times\uu) = F_i + \divergence{\boldsymbol{\sigma}}.
\end{equation}
Le système d'équations précédent est exprimé en Pa, soit des \(\text{Nm}^{-2}\).

De son côté, \textbf{l'équation de balance} est l'héritage principal de la mission AIDJEX \autocite{coon1974modeling,thorndike1975thickness}, cette dernière est définie comme
\begin{equation}
\label{eq:org762bb2e}
   \underbrace{\venti\pdv{g}{t}}_{\text{Évolution}} =
   -\underbrace{\venti\divergence{(g\uu)}}_{\substack{\text{Transport}\\\text{horizontal}}}\
   +\underbrace{\venti\psi}_{\substack{\text{Conservation}\\\text{de la masse}}}
   +\underbrace{\venti\pdv{(Fg)}{h}}_{\substack{\text{Fonte et}\\\text{croissance}}}
   +\underbrace{\venti L }_{\substack{\text{Entrée}\\\text{de glace}}}.
\end{equation}
où \(g(h)\) est définit comme la fraction de l'aide de glace dont l'épaisseur se situe entre \(h\) et \(h+\dd h\).
Grossièrement :
\begin{itemize}
\item \(\divergence{g\uu}\) est définit comme le transport horizontal;
\item Le terme \(\psi\) décrit comment la glace e mer s'épaissit pendant la convergence, dans le but de conserver la masse, c'est ce qu'on appelle la redistribution des épaisseurs (\emph{thickness redistribution}) \autocite[Voir][]{thorndike1975thickness};
\item \(\sfrac{\partial(Fg)}{\partial h}\) représente le changement dans la distribution des épaisseurs due à la fonte et à la croissance des glaces (par exemple les chutes de neige).
\(F\) vient souvent d'une étude ou d'un modèle thermodynamique pour la transformation de la glace en eau de mer;
\item \(L\) représente l'ajout ou l'entrée de glace dans l'océan.\bigskip
\end{itemize}

L'équation \ref{eq:org762bb2e} (aussi appelée la ITD pour « \emph{Ice Thickness Distribution} »)  est la seule connexion entre la dynamique de la glace de mer et la taille des floes qu'on connaissait jusqu'à très récemment.
La dépendance spatio-temporelle de la taille des floes (\ref{eq:org762bb2e}) a initialement été introduite par \Textcite{zhang2015sea}, mais c'est \Textcite{horvat2015prognostic} qui ont généralisée l'équation \ref{eq:org762bb2e} de sorte à prendre en compte l'évolution de la taille des floes comme facteur important dans la description d'état de la glace de mer.\bigskip

Considérant cela, \Textcite{horvat2015prognostic} relient ces deux variables dépendantes à l'aide d'une nouvelle distribution, la FSTD (pour « \emph{floe size and thickness distribution} »), dénotée par \(J(r,h)=J(\vb{r})\) où \(r\) est utilisé comme une variable d'échelle horizontale de nos floes et non strictement le rayon d'un disque -- comme on voit dans de nombreuses simulations.
L'expression la plus générale est dénotée par 
\begin{equation}
   \pdv{J}{t} = \-\divergence{(J\uu)} + \qty(\mathcal{L}_M + \mathcal{L}_T + \mathcal{L}_W) J,
\end{equation}
où \(\mathcal{L}_M ,\ \mathcal{L}_T ,\ \mathcal{L}_W\) représentent respectivement
\begin{itemize}
\item la redistribution mécanique;
\item les processus thermiques qui affectent la taille des floes et l'épaisseur;
\item le « \emph{wave induced breakup} ».
\end{itemize}
Ce dernier est définit comme
\begin{equation}
   \mathcal{L}_W(r,h) = -Q(r,h) \int_0^\infty Q(r',h) \beta(r,r',h) \dd r'.
\end{equation}
où \(Q(r,h)\) est une fonction qui donne la taille des fragments quand un floe de taille «\(r'\)» se brise.
On a malheureusement peu d'information sur tout ça, à part quelques expériences en laboratoire.

\subsection{La rhéologie}
\label{sec:org8d68159}

La mission AIDJEX considérait la glace comme un matériau plastique qui ne se déforme seulement que sous une contrainte critique.
C'est encore débattu dans la communauté si l'on devrait considérer la glace comme un matériau élastique, fragile, visqueux et/ou platique.
Il faut noter qu'on fait généralement des paramétrisation, car on n'a peu de moyen de s'informer sur les processus aux petites échelles.
Bref, on se souvient que \Textcite{hibler1979dynamic} définissait une rhéologie visco-plastique de la forme
\begin{equation}
   \sigma_{ij} = 2\eta \dot{\epsilon}_{ij} + (\eta + \zeta)\dot{\epsilon}_{kk} \delta_{ij} - \frac{p}{2}\delta_{ij},
\end{equation}
où \(p = (\sfrac{1}{2})(\sigma_1 + \sigma_2)\) est définit comme la \textbf{pression isotropique}.
Tandis que \(/eta\) et \(/zeta\) sont les \emph{bulk} et \emph{shear nonlinear viscosities} qui dépendent litérallement de tout (Ouin\ldots{}).
nn
On définit le tenseur du taux de déformation (\emph{strain rate}) par
\begin{equation}
\label{eq:org9db9907}
   \dot{\epsilon}_{ij} = \frac{1}{2}\qty(\pdv{u_i}{x_j} + \pdv{u_j}{x_i}). 
\end{equation}

\section{Parenthèse Wikipedia sur les tenseurs de déformation}
\label{sec:orgbe89798}
