2024/rapport-2024-07-12.org
** Tenseur de contrainte de Cauchy
#+NAME:fig:cube
#+CAPTION: Forces s'appliquant sur un élément inifitésimal cubique de volume $A^3$.
\begin{wrapfigure}[13]{r}{0.30\textwidth}
\begin{center}
\vspace{-1.2cm}
\begin{tikzpicture}
   % Faces du cube : 
   \filldraw[Mulberry!30] (0,0) -- (0,2) -- (2,2) -- (2,0) -- cycle; % Devant
   \filldraw[Mulberry!15] (2,0) -- (2.5,0.5) -- (2.5,2.5) -- (2,2) -- cycle; % Dessus
   \filldraw[Mulberry!5] (0,2) -- (0.5,2.5) -- (2.5,2.5) -- (2,2) -- cycle; % Droite

   % Flèches :
   \node [style={fill,circle,scale=0.3,Blue}] (devant) at (1,1) {};
   \node [style={fill,circle,scale=0.3,Blue}] (droit) at (2.25,1.25) {};
   \node [style={fill,circle,scale=0.3,Blue}] (dessus) at (1.25,2.25) {};

   % Devant
   \draw[-Triangle,thick, Blue] (devant.north) -- (1,1.5) node [left] {$F_{zy}$};
   \draw[-Triangle,thick, Blue] (devant.east)  -- (1.5,1) node [above] {$F_{zx}$};
   \draw[-Triangle,thick, Blue] (devant.south west) -- (0.75,0.75) node [left] {$F_{zz}$};

   % Droit
   \draw[-Triangle,thick, Blue] (droit.north) -- (2.25,1.75) node [right] {$F_{xy}$};
   \draw[-Triangle,thick, Blue] (droit.east)  -- (2.75,1.25) node [below=1mm] {$F_{xx}$};
   \draw[-Triangle,thick, Blue] (droit.south west) -- (2,1) node [below] {$F_{xz}$};

   % Top
   \draw[-Triangle,thick, Blue] (dessus.north) -- (1.25,2.75) node [left] {$F_{yy}$};
   \draw[-Triangle,thick, Blue] (dessus.east)  -- (1.75,2.25) node [above] {$F_{yx}$};
   \draw[-Triangle,thick, Blue] (dessus.south west) -- (1,2) node [left] {$F_{yz}$};

   % Mesure
   \node [] (A) at (3.2,1.5) {$a$};
   \draw[|{Triangle}-] (3.2,0.5) -- (A.south);
   \draw[|{Triangle}-] (3.2,2.5) -- (A.north);
   \draw[dotted] (3.2,0.5) -- (2.5,0.5);
   \draw[dotted] (3.2,2.5) -- (2.5,2.5);

   % Rose des vents :
   \node [] (rose) at (2.8,-0.2) {};
   \draw (2.8,-0.2) -- (2.8, 0.1) node [above,scale=0.5] {y};
   \draw (2.8,-0.2) -- (3.1,-0.2) node [right,scale=0.5] {x};
   \draw (2.8,-0.2) -- (2.6,-0.4) node [below,scale=0.5] {z};
\end{tikzpicture}
\end{center}
\end{wrapfigure}

Le tenseur des contraintes ([[https://en.wikipedia.org/wiki/Cauchy_stress_tensor][tenseur de Cauchy]]) est une matrice qui décrit *toutes les forces* pouvant s'appliquer, à la fois, sur les faces d'un élément cubique infinitésimal, mais aussi dans toutes les directions (Voir figure [[fig:cube]]).
Pour un continuum ou un domaine pouvant se déformer, les contraintes $\sigma_{ij}$ définies comme des unités de pression    ($\pt\sfrac{\text{Force}}{\text{Aire}}\Rightarrow\qty[\sfrac{N}{m^2}]\pt$).\bigskip
\begin{equation}
    \sigma_{ij} = \frac{F_{ij}}{a^2},
\end{equation}
*Pour chaque face de notre cube infinitésimal* -- dénotées par l'indice $i$ -- on peut définir une force $\vb{F}_i$ à l'aide de la base des vecteurs orthonormaux $\evf_x,\evf_y$ et $\evf_z$, s'appliquant sur cette même surface, soit
\begin{equation}
   \vb{F}_i =
   \begin{pmatrix}
     F_{ix} \\
     F_{iy} \\
     F_{iz} \\
   \end{pmatrix}\  = \ \sum_j F_{ij}\evf_j\ = \ F_{ix}\evf_x + F_{iy}\evf_y + F_{iz}\evf_z
\end{equation}
où $j$ la décrit la direction de la composante de la force s'appliquant sur la surface en question.
Rappellons que l'indice $i$ dénote le choix de la surface du cube, de sorte que le vecteur $\evf_i$ est normal au plan $i$.

Finalement, le tenseur de contraintes de Cauchy $\boldsymbol{\sigma}$ est condensé dans la matrice
\begin{equation}
   \boldsymbol{\sigma} = \frac{1}{a^2}
   \begin{bmatrix}
     \qty(\vb{F}_x)^\intercal\\
     \qty(\vb{F}_y)^\intercal\\
     \qty(\vb{F}_z)^\intercal\\
   \end{bmatrix}
   =
   \frac{1}{a^2}
   \begin{bmatrix}
     F_{xx} & F_{xy} & F_{xz} \\
     F_{yx} & F_{yy} & F_{yz} \\
     F_{zx} & F_{zy} & F_{zz} \\
   \end{bmatrix}
   =
   \begin{bmatrix}
     \sigma_{xx} & \sigma_{xy} & \sigma_{xz} \\
     \sigma_{yx} & \sigma_{yy} & \sigma_{yz} \\
     \sigma_{zx} & \sigma_{zy} & \sigma_{zz} \\
   \end{bmatrix}.
\end{equation}
Sur les lignes, ce sont les contraintes s'appliquant sur chaque faces.
Tandis que les colones représentent les forces dans la même direction et c'est pourquoi la divergence de cette quantité devient intéressante. 
Par coutûme, nous prenons la notation
#+name:eq:cauchy
\begin{align}
   &\boxed{\hspace{0.3cm}\boldsymbol{\sigma} =
   \begin{bmatrix}
     \sigma_{xx} & \tau_{xy} & \tau_{xz} \\
     \tau_{yx} & \sigma_{yy} & \tau_{yz} \\
     \tau_{zx} & \tau_{zy} & \sigma_{zz} \\
   \end{bmatrix},\hspace{0.3cm}}
\end{align}
pour différentier la diagonale (les contraintes normales) des autres termes (les contraintes de cisaillement).
Mentionnons aussi que le tenseur de contraintes est toujorus symmétrique.
Le tenseur de contraintes est donc une matrice (ou un tenseur) qui entrepose toutes les contraintes possibles. \bigskip

Donc, lorsqu'on applique cela à une rhéologie, concrétement on fait une différence de forces dans chaque directions, soit une divergence donnée par
\begin{align}
   \divergence{\boldsymbol{\sigma}}
   &= \qty(\pdv{}{x},\ \pdv{}{y},\ \pdv{}{z}) \cdot
   \begin{bmatrix}
     \sigma_{xx} & \tau_{xy} & \tau_{xz} \\
     \tau_{yx} & \sigma_{yy} & \tau_{yz} \\
     \tau_{zx} & \tau_{zy} & \sigma_{zz} \\
   \end{bmatrix}\nonumber\\
   &
   \begin{aligned}
    =\Bigg(&\qty[\pdv{\sigma_{xx}}{x}+\pdv{\tau_{yx}}{y}+\pdv{\tau_{zx}}{z}], \\
    &\quad\qty[\pdv{\tau_{xy}}{x}+\pdv{\sigma_{yy}}{y}+\pdv{\tau_{zy}}{z}],\\
    &\quad\quad\qty[\pdv{\tau_{xz}}{x}+\pdv{\tau_{yz}}{y}+\pdv{\sigma_{zz}}{z}] \Bigg).\\
   \end{aligned}
\end{align}
Si l'on désire observer de plus près, 
\begin{equation}
   \divergence{\boldsymbol{\sigma}} =  \Bigg(\underbrace{\venti\qty[\pdv{\sigma_{xx}}{x}+\pdv{\tau_{yx}}{y}+\pdv{\tau_{zx}}{z}]}_{\boxed{A}} ,\quad
   \underbrace{\venti\qty[\pdv{\tau_{xy}}{x}+\pdv{\sigma_{yy}}{y}+\pdv{\tau_{zy}}{z}]}_{\boxed{B}} ,\quad
   \underbrace{\venti\qty[\pdv{\tau_{xz}}{x}+\pdv{\tau_{yz}}{y}+\pdv{\sigma_{zz}}{z}]}_{\boxed{C}} \Bigg).
\end{equation}

#+NAME:fig:contrainte
#+CAPTION: Divergence des contraintes en x pour la composante $\evf_x$ à l'intérieur d'un cube. 
\begin{wrapfigure}[12]{l}{0.30\textwidth}
\vspace{-1cm}
\begin{center}
\begin{tikzpicture}
   % Faces du cube : 
   \filldraw[Mulberry!30] (0,0) -- (0,2) -- (2,2) -- (2,0) -- cycle; % Devant
   \filldraw[Mulberry!15] (2,0) -- (2.5,0.5) -- (2.5,2.5) -- (2,2) -- cycle; % Dessus
   \filldraw[Mulberry!5] (0,2) -- (0.5,2.5) -- (2.5,2.5) -- (2,2) -- cycle; % Droite

   % Flèches :
   \node [style={fill,circle,scale=0.3,Blue}] (devant) at (1,1) {};
   \node [style={fill,circle,scale=0.3,Blue}] (droit) at (2.25,1.25) {};
   \node [style={fill,circle,scale=0.3,Blue}] (dessus) at (1.25,2.25) {};
   \draw[-Triangle,thick, Blue] (devant.east)  -- (1.75,1) node [above] {$\tau_{zx}$};
   \draw[-Triangle,thick, Blue] (droit.east)  -- (3,1.25) node [below=1mm] {$\sigma_{xx}$};
   \draw[-Triangle,thick, Blue] (dessus.east)  -- (2,2.25) node [above] {$\tau_{yx}$};

   % Rose des vents :
   \node [] (rose) at (2.8,-0.2) {};
   \draw (2.8,-0.2) -- (2.8, 0.1) node [above,scale=0.5] {y};
   \draw (2.8,-0.2) -- (3.1,-0.2) node [right,scale=0.5] {x};
   \draw (2.8,-0.2) -- (2.6,-0.4) node [below,scale=0.5] {z};

   %
   \draw (3,2.25) node [] {\boxed{A}};
\end{tikzpicture}
\end{center}
\end{wrapfigure}

Observons principalement la quantité $\boxed{A}$.
Pour chaque nouvelle composante du vecteur $\divergence{\boldsymbol{\sigma}}$, on prend uniquement la variation des contraintes dans la même direction ($\tau_{ix}$), comme si c'était une quantité scalaire (e.g. un traceur) (Voir figure [[fig:contrainte]]). \bigskip


\nb Mentionnons que ce sont des forces.
L'important sera de lier ces forces à des propriétés émergentes de notre fluide ou de la glace.
Par exemple, relier le tenseur de contrainte de Cauchy ([[eq:cauchy]]) avec le tenseur de déformation ([[eq:strain]]) est un bon moyen, comme dans le [[file:rapport-2024-06-26.org][rapport précédent]].

