2024/Fichiers_tex/rapport-2024-07-12.tex

\subsection{Les fluides newtoniens selon Wikipedia}
\label{sec:org26a0965}

Un \href{https://en.wikipedia.org/wiki/Newtonian\_fluid}{fluide newtonien} est un fluide dont les contraintes visqueuses -- qui sont produites par son écoulement -- sont proportionnelles à son degré de déformation.\bigskip

Mathématiquement, la \textbf{relation de constitution} est donnée par le lien entre les contraintes de cisaillement et le taux de déformation, soit
\begin{equation}
   \boxed{\tall\quad\boldsymbol{\tau} \propto \dot{\boldsymbol{\epsilon}}.\quad}
\end{equation}
Dans une notation plus tensorielle, on pourrait dire que
\begin{equation}
\label{eq:org5f0b909}
   \tau_{ij} = \mu \qty(\pdv{v_i}{x_j} + \pdv{v_j}{x_i}),
\end{equation}
où \(\mu\) est justement la constante de proportionnalité.
On peut ensuite prendre l'équation \ref{eq:org5f0b909} en notation matrice pour obtenir la \emph{Stokes stress constitutive equation} (ou la loi des la viscosité de Newton) soit
\begin{equation}
   \boldsymbol{\tau} = \mu \qty(\gradient{\vv} + \divergence{\vv}^\intercal),
\end{equation}
où -- dans le monde des solide élatisques -- on utilise plutôt la notation
\begin{align}
   &&\boldsymbol{\tau} = 2\mu \dot{\boldsymbol{\epsilon}},
   && \text{où}
   && \dot{\epsilon}_{ij} = \frac{1}{2}\qty(\pdv{v_i}{x_j} + \pdv{v_j}{x_i}).&&
\end{align}
Mais tout ça, c'est du déjà vu.
Il faut savoir qu'on peut diviser les contraintes \textbf{isotropiques} et \textbf{déviatoires} à l'aide de l'expression
\begin{align}
\label{eq:orgdf38f4d}
   &&\boldsymbol{\sigma} = \underbrace{\frac{1}{3} \trace(\boldsymbol{\sigma})\mathbf{I}}_{\substack{\text{Partie}\\\text{isotrope}}} \quad \underbrace{+\quad\grande\boldsymbol{\sigma}',}_{\substack{\text{Partie}\\ \text{déviatoire}}}
   && \text{où}
   &&\sigma_{ij} = \pi\delta_{ij} + \sigma_{ij}'.&&
\end{align}
Comme énoncé ci-haut, la trace du tenseur de contraintes \(\boldsymbol{\sigma}\) est aussi souvent définit à l'aide de la variable \(\pi\), telle que
\begin{equation}
   \pi = \frac{\trace(\boldsymbol{\sigma})}{3} = \sum_k \frac{\sigma_{kk}}{3} = \frac{\sigma_{11} + \sigma_{22} +\sigma_{33}}{3} = \frac{\sigma_{kk}}{3}.
\end{equation}
La \textbf{partie isotrope} est aussi appelée le \href{https://en.wikipedia.org/wiki/Cauchy\_stress\_tensor}{tenseur de stress volumétrique}, car les forces normales à notre parcelle de fluide cubique infinitésimale n'ont un effet que sur sont volume.
Tandis que la \textbf{partie déviatoire} tend à déformer notre élément cubique inifinitésimal.
Le tenseur de stress déviatoire \(\boldsymbol{\sigma}'\) a donc la forme
\begin{align}
   &&\frac{1}{3} \trace(\boldsymbol{\sigma})\mathbf{I} =    \begin{bmatrix}
     \pi & 0 & 0 \\
     0 & \pi & 0 \\
     0 & 0 & \pi \\
   \end{bmatrix},
   &&\boldsymbol{\sigma}' =    \begin{bmatrix}
     \sigma_{xx}-\pi & \tau_{xy} & \tau_{xz} \\
     \tau_{yx} & \sigma_{yy}-\pi & \tau_{yz} \\
     \tau_{zx} & \tau_{zy} & \sigma_{zz}-\pi \\
   \end{bmatrix}.&&
\end{align}


En thermodynamique, la pression agit comme une force normale à une surface, d'où les unités de \(\mathrm{N}\cdot\mathrm{m}^{-2}\).
C'est aussi pourquoi un gradient de pression induit une force sur un élément infinitésimal de fluide.
Mentionnons que par définition,
\begin{equation}
\label{eq:org0b697bd}
   \trace(\boldsymbol{\sigma}') = \sum_k \qty(\sigma_{kk} - \pi) = \qty(\sum_k \sigma_{kk}) - 3\pi = \trace(\boldsymbol{\sigma}) - 3\cdot\qty(\frac{1}{3}\trace(\boldsymbol{\sigma})) = 0.
\end{equation}


Donc, \textbf{dans le cas d'un fluide incompressible}, \(\pi\) est littéralement la pression et on utilise la notation
\begin{equation}
   p = \frac{-\trace(\boldsymbol{\sigma}')}{3}.
\end{equation}

Selon \href{https://en.wikipedia.org/wiki/Newtonian\_fluid\#Newtonian\_law\_of\_viscosity}{Wikipedia}, la contrainte déviatoire \(\boldsymbol{\sigma}'\) coïncide avec le tenseur de contraintes \(\boldsymbol{\tau}\) (on va leur faire confiance là-dessus), 
\begin{equation}
   \boldsymbol{\sigma}' = \boldsymbol{\tau} = \mu \qty(\gradient{\vv} + \gradient{\vv}^\intercal),
\end{equation}
de sorte que l'éqation \ref{eq:orgdf38f4d} puisse se transformer comme
\begin{align}
\label{eq:org3002490}
   &&\boxed{\quad\tall\boldsymbol{\sigma} = -p \mathbf{I} + \mu \qty(\gradient{\vv} + \gradient{\vv}^\intercal)\quad}
   &&\text{ou}
   &&\boxed{\quad\sigma_{ij} = -p\delta_{ij} + 2\mu\dot{\epsilon}_{ij}\quad\tall}&&
\end{align}
