2024/rapport-2024-07-12.org
** Cas incompressible selon Wikipedia
Rapidement, dans le cas incompressible, *l'équation de constitution* ([[eq:constitution]]) est bien plus complexe, car on ajoute des termes liés à l'élasticité de notre élément cubique infinitésimal.
Grossièrement, on ajoute un tenseur de 4ème ordre pour la viscosité  «$\pt\mathbf{C}\pt$» plutôt qu'une constante $\mu$, de sorte à ce que l'équation de constitution ait la forme $\boldsymbol{\sigma}= - p\mathbf{I} + \mathbf{C}:\dot{\boldsymbol{\epsilon}}$ -- où le symbole «$\pt:\pt$» est le double produit scalaire (/Double dot product/).
 peut être représentée à l'aide des *paramètres de Lamé*, soient la seconde viscosité $\lambda$ et la viscosité dynamique $\mu$, à l'aide d'une décomposition de Helmholtz, donc
\begin{equation}
   \boldsymbol{\sigma}(\dot{ \boldsymbol{\epsilon}} ) = -p\mathbf{I} + \lambda\trace(\dot{\boldsymbol{\epsilon}}) \mathbf{I} + 2\mu\dot{\boldsymbol{\epsilon}}
\end{equation}
Selon [[https://en.wikipedia.org/wiki/Newtonian_fluid#Newtonian_law_of_viscosity][Wikipedia]], cette décomposition peut explicitement être définit comme
#+name:eq:compress
\begin{equation}
   \boldsymbol{\sigma} = -p\mathbf{I} + \lambda\qty(\divergence{\vv}) \mathbf{I} + \mu\qty(\gradient{\vv} + \qty(\gradient{\vv})^\intercal).
\end{equation}
Les traces de toutes les matrices de [[eq:compress]] sont données par
\begin{align}
   &&\trace(\dot{\boldsymbol{\epsilon}}) = \divergence{\vv}
   && \text{et}
   &&\trace(I) = 3.&& 
\end{align}
Donc,
\begin{align}
   \trace(\boldsymbol{\sigma}) = &
    -3p + \qty(3\lambda + 2\mu)\divergence{\vv}.
\end{align}

Maintenant, comme précédemment, on tente de diviser le tenseur de contrainte en partie *isotrope* et en partie *déviatoire*, soit
\begin{equation}
   \boldsymbol{\sigma} = -\qty[p + \qty(\lambda + \frac{2}{3}\mu)\qty(\divergence{\vv})]\mathbf{I} + \mu\qty(\gradient{\vv} + \qty(\gradient{\vv})^\intercal - \frac{2}{3}\qty(\divergence{\vv})\mathbf{I}).
\end{equation}
On introduit maintenant la [[https://en.wikipedia.org/wiki/Volume_viscosity][viscosité de volume]] (ou la /bulk viscosity/), comme $\zeta = \qty(\lambda + \frac{2}{3}\mu)$, et on arrive finalement à l'équation de constitution,
\begin{equation}
   \boldsymbol{\sigma} = \underbrace{\venti-\qty[p - \zeta\qty(\divergence{\vv})]\mathbf{I}}_\text{isotrope}
   +\underbrace{\venti\mu\qty(\gradient{\vv} + \qty(\gradient{\vv})^\intercal - \frac{2}{3}\qty(\divergence{\vv})\mathbf{I})}_\text{déviatoire},
\end{equation}
qui peut être réarrangée de sorte à obtenir
\begin{equation}
   \boxed{\quad\boldsymbol{\sigma} = -p\mathbf{I} + \mu\qty(\gradient{\vv} + \qty(\gradient{\vv})^\intercal) + \qty(\zeta - \frac{2}{3}\mu)\qty(\divergence{\vv})\mathbf{I}.\quad}
\end{equation}
En notation tensorielle, la relation de constitution (qui lie le taux de déformation aux contraintes) est décrite par
#+name:eq:elastoconsti
\begin{align}
   & \hspace{4.3cm}\text{Partie élastique}\nonumber\\
   &\boxed{\sigma_{ij} = -p\delta_{ij} + 2\mu\dot{\epsilon}_{ij} + \overbrace{\qty(\zeta-\frac{2}{3}\mu) \delta_{ij}\underbrace{\qty(\sum_k\pdv{v_k}{x_k})}},}\\
   & \hspace{5.8cm}\substack{\text{Volumetric}\\ \tall\pt\text{strain rate}}\nonumber
\end{align}
où l'on utilise la notation d'Einstein comme
\begin{equation}
   \divergence{\vv} = \sum_k \qty(\pdv{v_k}{x_k}) =
   \underbrace{\pdv{v_k}{x_k}\venti}_{\tall\text{Einstein}} =
   \underbrace{\venti\dot{\varepsilon}_V}_{\tall\text{Herman}} =
   \underbrace{\venti\epsilon_{kk}}_{\tall\text{Hunke}},
\end{equation}
pour représenter le taux de déformation volumique (/volumetric strain rate/).
Mentionnons que dans l'article de [cite/t/c:@herman2022granular], on utilise la notation $\varepsilon_V$ pour parler du taux de déformation volumique (/Volumetric strain rate/), tandis que dans l'article de [cite/t/c:@hunke1997elastic], on utilise plutôt la notation $\dot{\epsilon}_{kk}$ qui rappelle aussi la somme $\sum_k \dot{\epsilon}_{kk}$ en utilisant la terminologie du tenseur associé au taux de déformation $\dot{\epsilon}$.\bigskip

Toujours selon Wikipedia, la pression n'est malheureusement plus proportionnelle aux termes de contraintes isotropiques, comme on a vu l'apparition de la viscosité volumique $\zeta$, soit
\begin{equation}
   p = \frac{-1}{3} \trace(\boldsymbol{\sigma}) + \zeta\qty(\divergence{\vv}).
\end{equation}

* Retour à Herman

[cite/t/c:@herman2022granular] divise sont tenseur de contraintes de Cauchy $\sigma_{ij}^c$ en deux catégories, soient la pression isotrope $p^c$ et les contraintes déviatoires $\hat{\sigma}^c_{ij}$,

\begin{equation}
   \sigma_{ij}^c = -p^c\delta_{ij} + \hat{\sigma}_{ij}^c,
\end{equation}
où la somme des /normal stress components/ est nulle, $\hat{\sigma}^c_{11} + \hat{\sigma}^c_{22} = 0$ (voir eq. [[eq:trace]]).
Comme on l'a vu précédemment (voir [[eq:division]]),
#+name:eq:cauchystress
\begin{equation}
   \boldsymbol{\sigma}^c = \begin{bmatrix}
     -p^c + \hat{\sigma}^c_1 & \tau^c \\
     \tau^c & -p^c + \hat{\sigma}^c_2 \\
   \end{bmatrix},
\end{equation}
où $\tau = \sigma_{12} = \sigma_{21}$ sont les /tangential stress components/ comme nous sommes en deux dimensions pour bien représenter le domaine de glace.
Finalement, la *partie déviatoire* peut être décrite par
#+name:eq:deviatoire
\begin{subequations}
\begin{align}
   &\hat{\sigma}_i = 2\eta \dot{\varepsilon}_i + \qty(\zeta + \eta) \dot{\varepsilon}_V,\\
   &\tau_c = 2\eta\dot{\gamma},
\end{align}
\end{subequations}
où $\dot{\gamma} = \dot{\varepsilon}_{12} = \dot{\varepsilon}_{21}$ et la *déformation volumique* est définit comme $\dot{\varepsilon} = \dot{\varepsilon_1} + \dot{\varepsilon_2}$.
Les équation [[eq:deviatoire]]a,b sont complétement consistantes avec l'équation de constitution [[eq:elastoconsti]] de la section précédente, si le lecteur est intéressé à vérifier.
On ne montre seulement pas la partie isotrope liée à la pression comme dans [[eq:cauchystress]].\bigskip

En [[eq:deviatoire]]a et b, on référe à $\eta$ comme étant la *viscosité dynamique* (/shear viscosity/) et à $\zeta$ comme étant la *viscosité volumique* (/bulk viscosity/).
Cette dernière quantité référe à la résistance d'une fluide aux changements rapide de volume.
Pour un *fluide newtonien*, la viscosité dynamique $\eta$ est un scalaire.
Par contre, pour un *fluide non-newtonien*, $\eta$ est une viscosité apparente et une fonction de $\dot{\gamma}$, des propriétés matérielles du fluide et du temps.

Menionnons que [cite/t/c:@herman2022granular] divise sont tenseur du taux de déformation en
\begin{equation}
   \dot{\boldsymbol{\varepsilon}} = \begin{bmatrix}
     \dot{\varepsilon}_{11} & \dot{\varepsilon}_{12}\\
     \dot{\varepsilon}_{21} & \dot{\varepsilon}_{22} \\
   \end{bmatrix} =\begin{bmatrix}
     \dot{\varepsilon}_1 & \dot{\gamma} \\
     \dot{\gamma} & \dot{\varepsilon}_2 \\
   \end{bmatrix}
\end{equation}

Les fluides dont la viscosité ne dépend pas du temps peuvent être visqueux ($\tau^c(\dot{\gamma} = 0) = 0$  : Les contraintes internes dépendent directement du taux de déformation) ou viscoplastique ($\tau^c(\dot{\gamma} = 0) > 0$ : Il y a des contraintes, même si le taux de déformation à l'interne est nul).
Le premier n'offre aucun contrainte lorsqu'il n'y a pas de déformation, tandis que le second offre une contrainte s'il y a une déformation. 

#+print_bibliography:


